// @strict-types


#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

// Код процедур и функций

#КонецОбласти
#Область ОбработчикиСобытийЭлементовТаблицыФормыПродукция
&НаКлиенте
Процедура ПродукцияНоменклатураПриИзменении(Элемент)
	ТекДанные = Элементы.Продукция.ТекущиеДанные;
	Пересчет(ТекДанные)
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиКомандФормы

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

	Процедура Пересчет(ТекДанные)
		ТекДанные.СданоБезПТЛ = ТекДанные.Сдано - ТекДанные.ОтобраноПТЛ;
		ТекДанные.Количество = ТекДанные.Номенклатура.ВесЕденицы *  
	КонецПроцедуры

#КонецОбласти
